[
  {
    "id": 1,
    "thread_id": 1,
    "user_id": 14,
    "content": "I had rhinoplasty about a year ago and your experience sounds very similar to mine. The psychological aspect was definitely the hardest part! That \"middle phase\" where you're still swollen but the initial excitement has worn off was tough.\n\nOne thing I wish I'd known was how much the tip of my nose would change over time. It took almost a full year for it to reach its final shape, which was longer than I expected.\n\nOverall though, I'm very happy with my decision. My breathing is so much better now (I had a deviated septum), and I feel more confident in photos.",
    "is_anonymous": false,
    "is_doctor_response": false,
    "created_at": "2025-04-24 20:16:38.010897",
    "upvotes": 5,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  },
  {
    "id": 2,
    "thread_id": 2,
    "user_id": 79,
    "content": "Thanks for sharing such a detailed timeline! I'm scheduled for BA next month and this helps me know what to expect.\n\nQuestion - did you find that you needed help at home during the first week? I live alone and am trying to decide if I should have someone stay with me.",
    "is_anonymous": false,
    "is_doctor_response": false,
    "created_at": "2025-05-03 20:21:08.203152",
    "upvotes": 3,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  },
  {
    "id": 3,
    "thread_id": 2,
    "user_id": 63,
    "content": "I had my BA about 3 months ago and your timeline is spot on! The \"drop and fluff\" is real - mine looked so unnatural at first but now they've settled beautifully.\n\nOne thing I'd add is that I experienced random sharp pains (like nerve zings) around week 5-8 as everything was healing. My surgeon said this was normal nerve regeneration.\n\nAlso, sleeping was difficult for me for almost 6 weeks. I had to sleep on my back with pillows on either side to prevent accidentally rolling onto my side or stomach.",
    "is_anonymous": false,
    "is_doctor_response": false,
    "created_at": "2025-04-30 20:21:08.203152",
    "upvotes": 4,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  },
  {
    "id": 5,
    "thread_id": 4,
    "user_id": 35,
    "content": "I had a tummy tuck 2 years after my second C-section, and the surgeon was able to completely remove my C-section scar as part of the procedure. The new tummy tuck scar is lower and thinner than my old C-section scar was.\n\nOne thing to note is that if you have any numbness around your C-section scar (which is common), you'll likely have a larger numb area after the tummy tuck. I have numbness from hip to hip above the new scar, but it doesn't bother me.\n\nRecovery wasn't harder because of my previous surgeries. In fact, my surgeon said the internal scar tissue from C-sections can sometimes provide additional support for the muscle repair.\n\nI waited 3 years after my last pregnancy before getting the tummy tuck. My surgeon recommended waiting until I'd been at a stable weight for at least 6 months.",
    "is_anonymous": false,
    "is_doctor_response": false,
    "created_at": "2025-05-17 20:22:52.801644",
    "upvotes": 6,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  },
  {
    "id": 6,
    "thread_id": 5,
    "user_id": 122,
    "content": "My bruising after lipo on similar areas lasted about 3 weeks total, but it faded gradually. By the end of the second week, it was yellow rather than purple/blue and much less noticeable.\n\nWhat helped me: arnica (like you're doing), gentle walking to increase circulation, and staying super hydrated. My doctor also recommended pineapple for its bromelain content, which may help with swelling.\n\nAs for the compression garment, I wore mine 24/7 for 4 weeks, then only during the day for 2 more weeks. Don't rush taking it off - it really helps with skin retraction and reducing swelling!",
    "is_anonymous": true,
    "is_doctor_response": false,
    "created_at": "2025-05-15 20:23:02.544529",
    "upvotes": 4,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  },
  {
    "id": 7,
    "thread_id": 6,
    "user_id": 84,
    "content": "I had upper and lower blepharoplasty at 54, and it was one of the best decisions I've made. I'm now 58 and still very happy with the results.\n\nAs for how much younger it made me look - people consistently guess my age about 7-10 years younger than I am. But more importantly, I no longer look perpetually tired or sad. Friends and coworkers said I looked \"refreshed\" rather than \"different,\" which is exactly what I wanted.\n\nRecovery: I had significant bruising that lasted about 2 weeks. I was comfortable running errands with sunglasses after 10 days. At 3 weeks, makeup easily covered any remaining discoloration.\n\nI did experience dry eyes for about 3 months, but using preservative-free eye drops helped tremendously. This resolved completely.\n\nMy advice: Find a surgeon who specializes in eyes specifically (oculoplastic surgeon or facial plastic surgeon with lots of eye experience), and be very clear about wanting natural results.",
    "is_anonymous": false,
    "is_doctor_response": false,
    "created_at": "2025-05-08 20:23:12.369693",
    "upvotes": 9,
    "parent_reply_id": null,
    "is_expert_advice": false,
    "is_ai_response": false,
    "photo_url": null,
    "video_url": null
  }
]